{
  "collection": "mac-automation-scripting-guide",
  "path": "index.md",
  "title": "About Mac Scripting",
  "body": "<a id=\"//apple_ref/doc/uid/TP40016239-CH56\"></a><a id=\"//apple_ref/doc/uid/TP40016239-CH56-SW1\"></a>\n<a id=\"//apple_ref/doc/uid/TP40016239-CH2\"></a><a id=\"//apple_ref/doc/uid/TP40016239-CH2-SW1\"></a>\n\n## About Mac Scripting\n\nScripting allows you to automate complex, repetitive, and time-consuming tasks by writing scripts that interact with apps, processes, and the operating system. A script consists of a series of statements, each of which performs a specific operation. These statements work together to automate tasks. Through scripting, you can create powerful workflow solutions that enhance productivity, reduce errors, save time, and save money.\n\nThere are many different scripting languages. On the Mac, the primary ones used for automation are *AppleScript* and *JavaScript*.\n\n> **Note**\n>\n>\n> OS X also includes Automator, an app for building workflows that run prebuilt, configurable actions to perform tasks in apps and throughout the operating system. Automator doesn’t require you to write any code, but can be extended through scripting. Because Automator uses preconceived actions and operates in a linear manner, it’s more limited in functionality than scripting. Automator is great for performing simple tasks involving a small number of sequential steps or apps. Scripting is a better choice for performing advanced, branching, or complex tasks.\n>\n> Python and Perl are other examples of scripting languages.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH56-SW3\"></a>\n\n### AppleScript\n\nAppleScript is a mature scripting language developed by Apple. It’s relatively easy to learn in relation to other scripting and programming languages, has been around since System 7.1, and has been widely adopted in both enterprise and personal workflows. While the AppleScript scripting language uses an English-like terminology which may appear simple, it is a rich, object-oriented language, capable of performing complicated programming tasks.\n\nThe core fundamentals of AppleScript are described in *[AppleScript Language Guide](https://developer.apple.com/library/archive/../../AppleScript/Conceptual/AppleScriptLangGuide/introduction/ASLR_intro.html#//apple_ref/doc/uid/TP40000983)*, as well as in numerous third-party books.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH56-SW4\"></a>\n\n### JavaScript\n\nJavaScript is a popular cross-platform scripting language. Historically, it’s been most commonly used to implement features on websites and in web-based apps that are accessed through browsers. However, some apps implement JavaScript-based scripting models for the purpose of automation. In OS X 10.10, JavaScript became a peer to AppleScript in OS X. There are many third-party websites and books that document the JavaScript language.\n\nFor fundamentals on JavaScript as a scripting language for automation in OS X, see *[JavaScript for Automation Release Notes](https://developer.apple.com/library/archive/../../../releasenotes/InterapplicationCommunication/RN-JavaScriptForAutomation/Articles/Introduction.html#//apple_ref/doc/uid/TP40014508)*. For information about the JavaScript language, see [Mozilla’s official JavaScript documentation](https://developer.mozilla.org/en-US/docs/Web/JavaScript).\n",
  "binary": false,
  "source_url": "https://developer.apple.com/library/archive/documentation/LanguagesUtilities/Conceptual/MacAutomationScriptingGuide/index.html",
  "sha256": "907fdd55c69c521ebb267152d9a9bb4f86785c68fb73dba1bbcda2fa67e56166",
  "etag": null,
  "last_modified": null
}
