{
  "collection": "mac-automation-scripting-guide",
  "path": "UsetheSystem-WideScriptMenu.md",
  "title": "Using the Systemwide Script Menu",
  "body": "<a id=\"//apple_ref/doc/uid/TP40016239-CH7\"></a><a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW1\"></a>\n\n## Using the Systemwide Script Menu\n\nThe OS X script menu provides quick access to your collection of scripts. Simply select a script in the menu at any time to run it instantly. Within the script menu, scripts can be organized into subfolders and by application. See Figure 41-1.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW4\"></a>\n**Figure 41-1**The OS X script menu\n![image: ../Art/scriptmenu_2x.png](https://developer.apple.com/library/archive/mac-automation-scripting-guide/Art/scriptmenu_2x.png)\n> **Note**\n>\n>\n> The script menu can run compiled scripts, as well as scripts saved as apps. It can also run UNIX shell scripts and Automator workflows.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW6\"></a>\n\n### Enabling the Script Menu\n\nThe script menu is disabled by default in OS X.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW7\"></a>\n\n**To enable the script menu**\n\n1. Launch Script Editor, located in `/Applications/Utilities/`.\n2. Select Script Editor &gt; Preferences, or press Command-Comma (,), to open the preferences window.\n3. Click General in the toolbar.\n4. Enable the “Show Script menu in menu bar” checkbox.\n5. Choose whether application scripts—scripts that appear only when a corresponding app is in the front—should appear at the top or bottom of the script menu.\n\n   <a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW3\"></a>\n\n   ![image: ../Art/scripteditor_scriptmenu_preferences_2x.png](https://developer.apple.com/library/archive/mac-automation-scripting-guide/Art/scripteditor_scriptmenu_preferences_2x.png)\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-DontLinkElementID_11\"></a>\n\n\nTip\n\nThe script menu displays scripts in the `~/Library/Scripts/` folder of your user directory. To include scripts at the computer-level (in the `/Library/Scripts/` folder), enable the “Show Computer scripts” checkbox.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW8\"></a>\n\n### Adding User-Level Scripts to the Script Menu\n\nUser-level scripts are scripts that only you can see and use. They aren’t available to other users on your Mac.\n\nTo add user-level scripts to the script menu, save them into the `~/Library/Scripts/` folder of your user directory. For quick access to this folder, select Open Scripts Folder &gt; Open User Scripts Folder from the script menu. When you do this, the folder is automatically created if it doesn’t already exist.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW9\"></a>\n\n### Adding Computer-Level Scripts to the Script Menu\n\nComputer-level scripts are scripts that any user on your Mac can see and use.\n\nTo add computer-level scripts to the script menu, save them into the `/Library/Scripts/` folder on your Mac. For quick access to this folder, select Open Scripts Folder &gt; Open Computer Scripts Folder from the script menu. When you do this, the folder is automatically created if it doesn’t already exist.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW10\"></a>\n\n### Adding Application-Specific Scripts to the Script Menu\n\nApplication-specific scripts are only visible in the script menu when a specific app is in the front.\n\nTo add application-specific scripts to the script menu, save them into the `~/Library/Scripts/Applications/«ApplicationName»` folder in your user directory or the `/Library/Scripts/Applications/«ApplicationName»` folder on your Mac. For quick access to this folder, bring the app to the front, then select Open Scripts Folder &gt; Open «ApplicationName» Scripts Folder from the script menu. When you do this, a folder for the application is automatically created if it doesn’t already exist.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW11\"></a>\n\n### Running Scripts in the Script Menu\n\nSelect a script from the script menu to run it. If the script is an application, it launches and runs normally. If the script is a compiled script, a progress indicator appears in the menu bar. See Figure 41-2.\n\n<a id=\"//apple_ref/doc/uid/TP40016239-CH7-SW2\"></a>\n**Figure 41-2**Script menu progress\n![image: ../Art/scriptmenu_progress_2x.png](https://developer.apple.com/library/archive/mac-automation-scripting-guide/Art/scriptmenu_progress_2x.png)\n> **Note**\n>\n>\n> To reveal a script in the script menu, select it in the menu while pressing the Shift key.\n>\n> To open a script menu script in Script Editor, select it in the menu while pressing the Option key.\n",
  "binary": false,
  "source_url": "https://developer.apple.com/library/archive/documentation/LanguagesUtilities/Conceptual/MacAutomationScriptingGuide/UsetheSystem-WideScriptMenu.html",
  "sha256": "1aa62879d04f8541c0580f9a60a74b35e719b1d356cd145d08c83180c6482894",
  "etag": null,
  "last_modified": null
}
